curl -XPOST http://localhost:9200/_bulk -H "Content-type: application/json" -d '
{ "index": { "_index": "topic"} }
{ "category": "1","topicStatus":"Resolved", "title":"グラフの中の文字列","content":"グラフの中の文字の色を変更したり、サイズを変更したりする方法がわかりません。","transcript": "" }
{ "index": { "_index": "topic"} }
{ "category": "2","topicStatus":"Resolved", "title":"インデントが元にもどらない","content":"ワードで編集中のファイルのインデントが元にもどりません。","transcript": "" }
{ "index": { "_index": "topic"} }
{ "category": "3","topicStatus":"Resolved", "title":"テンプレートの適用方法","content":"ちょっとレトロな感じのテンプレートを写真に適用したいのですが、やり方がわかりません。","transcript": "" }
{ "index": { "_index": "topic"} }
{ "category": "4","topicStatus":"Resolved", "title":"トーンカーブの使い方。","content":"トーンカーブが思ったように使いこなせません。コツを教えてもらいたいです。","transcript": "" }
{ "index": { "_index": "topic"} }
{ "category": "5","topicStatus":"Resolved", "title":"VSCodeでeslintのimportエラーが解決しない","content":"VSCode,ESLint,javascriptで開発していますが、どうしてもimportの指摘が消えません。","transcript": "" }
{ "index": { "_index": "topic"} }
{ "category": "5","topicStatus":"Resolved", "title":"Javascriptで開発する時に何かいいフレームワークはありますか？","content":"JSで開発を行おうとしていますが、フレームワークがたくさんあります。どうすればいいでしょう","transcript": ""}
{ "index": { "_index": "topic"} }
{ "category": "5", "topicStatus":"Resolved","title":"Javascriptの使い方について教えてほしいです","content":"Javascriptってそもそもどう動くか知りたいです","transcript": "そう そう そう 私 も そう だっ た ね え え え え え え え え え え え 東急 線 的 我 不 得意 な ん です けど 今回 は あの ま ジャバスクリプト を やっ て いき ます え? スキー ラブ という サイト を 作っ て い て 後 は 教育 関連 の お 仕事 で ある と か 後 ま 受託 開発 で ある と か です ね 結構 やっ て ます 企業 の ウェブ 技術 という 本 が 日本 実業 出版 から 出 て ます ので 是非 です ね 手 に 取っ て み て ください では 本日 の 目的 と 内容 を い ます ね あのー ジャバスクリプト と は って いう こと です けれど も 今日 は こう 何 が できる か って いう の を えーっと ま ざっと やっ て いき たい な と 思い ます えーっと 何 を? する か と 言う と もう 本当 に プログラミング の 基本 的 な 内容 です ね 変数 と か 関数 と か で ジャバスクリプト 時 の イベント と か です ね え を まず やっ て いっ て ソレ を 使っ て 簡単 な ま フォーム から 取り出す カウンター で ある と か 実際 の ジャバスクリプト の ま なんて いう か な? ちょっとした ウェブアプリケーション を 作っ て いこ う か な と 思っ て い ます で えーっと ま 今日 の 口座 ね 簡単 ミニマム に やり ます けれども ジャバスクリプト の ま 何たる か という か です ね ま 深い ところ まで は 行き ませ ん? けれども あのー イメージ を 付け て いただい て 今 まで じゃ バスケット って 何 な ん だろ う な と 思っ てる 方 って 結構 いる と 思う ん です よ でも あの この 講座 を やっ て 頂けれ ば あのー 結構 です ね イメージ は 掴め ます し あと は こんな もの な の か と 書き 方 って こう すれ ば こう なる の ね って いう の が 分かる と 思う ん です ね で えーっと ここ の 口座 で 分かっ て いただい たら もっと 深く やっ て いけ ば いい か な と ま 足がかり として ま 最初 の ステップ と し と し て の 口座 と 思っ て 頂けれ ば いい か な と 思い ます で は えーっと 早速 です ね やっ て まいり ます よ じゃ 行き ます 初めて の ジャバスクリプト ね ジャバスクリプト で 一体 何 が できる うん ジャバスクリプト が できる こと と いう と 皆さん ね 何 を? 思い浮かべる でしょ う か ま 一体 何 な ん? だろ う な 見当 も 付か ない 人 も いる かも しれ ませ ん けど も ここ で 書い て ある イベント 処理 する ページ を 読み込ん だ 時 とか クリック し た 時 ね あのー ウェブサイト その 時 の ま 操作 イベント を 使っ て 何 か 操作 できる です よ って 時間 や 日時 で ある と か 溝 要素 間 これ も 初めて 聞く かも しれ ない です ね これ は です ね ま を 構成 し て いる 要素 の 事 を どの 要素 って 言う ん です よ ね システムズ サイト で こう やっ て 作る じゃ ない です か その 中 の 一つ 一つ 溝 要素 を コントロール する こと が できる とか など など 色々 あり ます けれど も ま これ 後 で ね 見 て み て ください ね じゃ 実際 に です ね ま こんな ずっと やっ て も 別 と 言っ て も まあ まあ そんな もん か と 思う かも しれ ない の で えーっと 実際 の サイト を 見 て 何 が できる か 少し イメージ を 持っ て もらい たい な と 思う ん です けれど も 例えば そう です ね えーっと 例えば この グーグル の ラップ か な 後 この グーグルマップ 大分 前 に 行っ て まし た けれど も こういう 風 に 動かせる びっくり し た ん です よ ね ずっと 前 で これ は 何 で でき て いる か って いう と あの ジャバスクリプト で 制御 さ れ て いる と ま ここ まで できる だ な って いう こと 例えば 他 に も こういう メニュー を? 出し たり とか 閉まっ たり とか えーっと 共有 の 学校 何 か 出 て き たり だ と か ね こう いう もの を 実現 する の は ジャバスクリプト で でき ます うん ま こう なっ て くる と ここ まで なっ て くる と ウェブ アプリケーション 開発 も 凄い 大変 です けれども その ジャバスクリプト の 最高峰 と 言っ て いい かも しれ ない です ね という え? こう いう よう な です ね ウェブ アプリケーション を 作成 する こと が でき ます あと は ま よく ある ウェブサイト の ソニー の プレイステーション と か ね あり ます けれども この 中 の 例えば ゲーム の ページ お ふわっと 出 て き て 何 か あのー こう いう ちょっと 動き が ある よう な ヤツ ある じゃ ない です か ね? そう 同 課 が 出 てる んで ソレ 動画 お送り でき て と か で バス ボタン で 閉じ て と か こう いう ユーザー が 何 か アクション し て ソレ に 対応 し て くれる よう な サイト を 作る 場合 は ジャバスクリプト を 使い ます で こう いう もの を えーっと フロント エンド と 寝 て い ます こう ブラウザー で 起こる こと ね ブラウザー で の 先程 こと フロント エンド って で 例えば そのー クリック し て 何 か 情報 を 渡す とき 情報 を 渡し て その データーベース 処理 する と か って いう の が あり ます ね 例えば えーっと 何 か お 申し込み フォーム か 何 か に 入力 し て こう いう ね お 申し込み フォーム に 入力 し て で ソレ を クリック する と その 内容 が 送信 さ れる で 送信 さ れる の データーベース に 行っ て で データーベース を やり取り し て ウェブサーバー で また 帰っ て くる と か こういう の を バック エンド と 言い ます ね バック エンド から 帰っ て き た この 情報 を ブラウザー で 処理 する ね ここ の さっき やっ た よう な こう いう 動画 で 精 動画 の ページ 送り みたい な もの こういう ユーザー の 目 に 見える もの で やる 処理 の こと を フロント エンド と 思っ て い ます で ジャバスクリプト って いう の は ま フロント エンド の 異 音 な の で、 えーっと 今回 の お 勉強 は です ね フロント エンド について の 勉強 に なり ます では ちょっと スライド に 戻り まし た か ね できる こと を もう 一 回 見 て みる と イベント や えーっと 日時 や 道具 あと は タイマー が 使える と か 方 も 操作 できる とか ウインドウ 操作 できる、 茎 が 使える キーボード 操作 キーボード 操作 が できる です よ ね、 えーっと 例えば メール と か って キーボード 性 と か と でき たり し、 ます けど エイ ジャックス が 使う エイ ジャックス は リアルター 別 し さっき の グーグルマップ で グーグルマップ って こう スクロール し て いく と 裏 の サーバー と リアルタイム で 更新 し てる ん です よ、 今度 エージャックス って 言い ます うん では 最初 の レッスン です ね 基礎 中 の 基礎 と いう ところ を やっ て み まし た か では やっ て み ます ね まず えーっと はじめて の プログラミング って いう こと です ね ま ジャバスクリプト の 描き 方 から 見 て いく と えーっと コード なし の 場合 は? この スクリプト スクリプト の 場合 は スコート が 中 に 入っ てる か ない から 言っ てる ん です けれども まずは この スクリプト タグ に 禍根 で あげる これ の 中 に 各 話 です よ の なか に は スクリプト っていう タグ を 入れ て あげ て その 中 に コード を 書い て いき ます レコード あり の 場合 で 実際 に 見 て みる と スクリプト タグ が あっ て その 中 に ジャバスクリプト が あり ます うん これ が まず 基本 で は えーっと じゃあ アスペクト な の ね えーっと コード 書い て み まし た か デスク トップ ま どこ で も いい です けど ちょっと 新規 フォルダー を 作り ます ね で ジャバスクリプト 講座 に し て おき まし た ので これ を サブ ライム テキスト か 何 か ま 自分 の 気 に 入っ た エディター で いい ので 開い て ください で そこ に です ね えーっと に ファイル を 作り ます で まず 保存 し ます ね 困ん です と か 本当 の レス で。 で これ は 何 島しょ か 最初 の な ので 定数 一 度 と え 否定 命令 に し まし た か ベース 一 度 と 初めて 保存 し て で 多分 で 基本 的 な 作り ます ね。 で ここ に は ジャバスクリプト の 練習 な ので です ね ちょっと あの お 見せ し たい です けれど も 普通 ね あのー を 書く とき 一 足す 一 は 一、 三 センチ で 各 じゃ ない です か で 保存 し て で ブラウザー で 見 て み ます ブラウザ で 見る の は え? うん 市田 吸い 始め でき て ます ね。 でしょ ちょっと 半分 半分 に し ます で 下 州 市 で よいしょ これ で こう だ よ と うん し て き まし た か で えーっと ここ の 書い た 時 日田 周一 高 出 て ます よ ね ね って ま 勿論 そのまま 出る 訳 です でも ジャバスクリプト の 場合 って の は ちょっと 違う です ね デジャヴ アスペクト で 書く 場合 に は ここ に スクリプト タグ って いう の を 埋め込み ます で これ この テキスト タイプ 書い て も 書い 書か なく て も いい です けれど も じゃあ 今回 なし で ね を 変え て、 この 間 に プログラム を 書き ます で えーっと ここ に です ね ま、 新戸 はい ね これ アラート って いう ので 最後 セミコロン 様 付ける と 最後 セミコロン つけ ます ね で こちら で リロード する と ほら はい 出 て き まし た お いい です ね じゃ この 範囲 って あり ます けど これ 決して この 中 が 実行 さ れ て いる って いう の が 分かり まし た って ね! ドキュメント えーっと と ライン と って いう の が ある です ね で、 こう する と ま システム で こう 普通 に。 書く 場合 は ボディー の 中 に 書け ば いい です けれど ジャバスクリプト で ここ に 表示 する 場合 は ドキュメント ドット ライト って いう の が 必要 な ん です よ、 じゃあ はい そう する と ね。 ほら はい って 出力 さ れ まし た ね そう そう いう こと な ん です ま これ は 何 か 文字 表示 する だけ だ! から ここ でも できる じゃ ない か と って 思う かも しれ ませ ん じゃ 今度 この ジャバスクリプト の 中 で 一 足す 一 と こう 書い て み ます よ そう する と どう なる か え に なり まし た ね これ ね ここ は 一 足す 市 が そのまま 表示 さ れる わけ じゃ なく て じゃ バスケット を 計算 し て くれ て その 結果 を ここ に ドキュメント ドット ライト し て くれ て いる 訳 です ね そう な ん です ジャバスクリプト っていう の は 何らかの 処理 を し て ここ に 出力 し て くれ たり ま 色んな プログラム ご に 多い よ ね 裏 で やっ て くれる 訳 です" }
{ "index": { "_index": "topic"} }
{ "category": "5", "topicStatus":"Resolved","title":"Javascriptのテストフレームワークの書き方について教えてほしいです！","content":"jestとvscodeでやってますが、いまいち書き方がわかりません。誰か教えていただけないでしょうか？","transcript": "" }
{ "index": { "_index": "topic"} }
{ "category": "5","topicStatus":"Resolved", "title":"tslintのimportで困ってます","content":"tslintのバージョンは4.6.7です","transcript": "" }
{ "index": { "_index": "topic"} }
{ "category": "5", "topicStatus":"Resolved","title":"","content":"","transcript": "" }
{ "index": { "_index": "topic"} }
{ "category": "","topicStatus":"Resolved", "title":"","content":"","transcript": "" }
{ "index": { "_index": "topic"} }
{ "category": "", "topicStatus":"Resolved","title":"","content":"","transcript": "" }

'